{
  "links": {
    "introduction": "Introduction",
    "about": "About",
    "experiences": "Experiences",
    "educations": "Educations",
    "projects": "Projects",
    "contact": "Contact"
  },
  "timeline": {
    "tags": "Technologies"
  },
  "profileCard": {
    "developer": "Developer.",
    "based_in": "Based in Annecy, France 🇫🇷",
    "hire_me": "HIRE ME!"
  },
  "heroSection": {
    "line1": "Hi there!",
    "line2": "I'm Johan, a Software Engineer passionate about crafting user-friendly web apps. Check out my work below!",
    "resume": "Download my resume here",
    "about_me": "About me",
    "years_of": "years of",
    "experience": "experience"
  },
  "aboutMe": {
    "title1": "my",
    "title2": "path",
    "phrase1": "📚 I initially stopped studying after completing a Technological Baccalaureate. From odd jobs to odd jobs, I quickly realized that this context would not be enough for me. So, at the age of 21, I decided to resume my studies and pursue a degree in e-commerce.",
    "phrase2": "🏋️‍♂️ These studies allowed me to work as an SEO specialist for 6 years. This experience taught me about the functioning of the professional world, teamwork, the weight of responsibilities, as well as managing a back office and search engine optimization.",
    "phrase3": "🍀 As a SEO specialist, working closely with developers sparked my interest in this highly technical field. Therefore, I enrolled in a 6-month bootcamp training program to acquire the fundamentals of web programming and coding. Following that, I continued my learning journey through an apprenticeship program, pursuing a degree in Web and Mobile Applications Integration/Development with a specialization in React and Node.js.",
    "phrase4": "🍾 Since then, I have worked with several companies on complete integrations, provided assistance to deliver projects on time, made modifications, and added new features...",
    "phrase5": "👷 Today, drawing strength from my journey, I master the intricacies of the Agile methodology, the principles of Clean Code, and CI/CD pipelines, ensuring optimal scalability and maintainability for each web application I develop. My diverse experience, spanning from SEO to programming, enables me to bring a unique perspective to every project.",
    "phrase6": "🧘‍♂️ As a Web Developer since 2020, I thoroughly enjoy working with Nuxt & NextJs in an Agile environment, adhering to clean code principles, and implementing CI/CD pipelines. I take pleasure in transforming mockups of various styles into dynamic and interactive websites to enhance the user experience.",
    "go_to_my_experiences": "My Experiences"
  },
  "experiences": {
    "title": "my experiences",
    "go_to_educations": "My educations",
    "items": [
      {
        "company": "Winter Energies",
        "title": "Software engineer",
        "years": "2024 - (ongoing)",
        "description": "As a frontend developer at Winter Energies, I create modern, high-performance user interfaces with Next.js, TailwindCSS, and TypeScript, contributing to sustainable energy consumption by delivering scalable and reliable solutions."
      },
      {
        "company": "La Boîte Immo",
        "title": "Software engineer",
        "years": "2022 - 2024",
        "description": "Building robust real estate management software to streamline operations and enhance efficiency for independent real estate agents."
      },
      {
        "company": "Free-lance",
        "title": "Freelance Developer",
        "years": "2022 (ongoing)",
        "description": "Delivering tailor-made solutions to clients, ensuring their unique needs are met with high-quality development expertise."
      },
      {
        "company": "GetUp Agency",
        "title": "Front-End Developer",
        "years": "2022",
        "description": "Crafting engaging and user-friendly front-end experiences for clients, helping them achieve their online presence goals."
      },
      {
        "company": "Vitassurance",
        "title": "Front-end & Back-end Developer",
        "years": "2021",
        "description": "Insurance brokerage website that allows you to quickly compare offers from different insurers. Once the visitor fills out the form, their information is sent via an API to a CRM to manage the new client's file."
      },
      {
        "company": "poupepoupi.com",
        "title": "Web Analyst (6 years)",
        "years": "2014 - 2020",
        "description": "Providing insights and optimizations to maximize website performance and drive business growth through data-driven strategies."
      },
      {
        "company": "Large Retail Chains | Garden Centers | Animation",
        "title": "Various jobs in different fields",
        "years": "2011 - 2014",
        "description": "Acquired versatile skills and valuable experience by working in diverse roles across multiple industries."
      }
    ]
  },
  "educations": {
    "title": "my educations",
    "go_to_projects": "My projects",
    "items": [
      {
        "company": "3WAcademy",
        "title": "(BSc) Web and Mobile Applications Integration/Development",
        "years": "2020 - 2021",
        "description": ""
      },
      {
        "company": "OpenClassrooms",
        "title": "Web Developer - Level 5 RNCP Certification",
        "years": "2020",
        "description": ""
      },
      {
        "company": "University of Toulon",
        "title": "(BSc) E-commerce & Digital Marketing",
        "years": "2016 - 2017",
        "description": ""
      },
      {
        "company": "Défi83 - Toulon",
        "title": "(Associate's Degree) Business Unit Management",
        "years": "2014 - 2016",
        "description": ""
      },
      {
        "company": "Jean Aicard - Hyères",
        "title": "Baccalaureate in Business Science & Technology",
        "years": "2010 - 2012",
        "description": ""
      }
    ]
  },
  "contact": {
    "title1": "Let's work",
    "title2": "together",
    "phrase": "Feel free to reach out to me via email for collaborations or inquiries.",
    "contact_me": "Contact me"
  }
}
